<a href="https://colab.research.google.com/github/seungbinahn/START_AI/blob/master/02_Machine_Learning%E2%80%8E/02_Pandas_%EB%A6%AC%EB%B7%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# pandas

* 2차원 데이터를 효율적으로 가공 및 처리

In [ ]:
import pandas as pd
import numpy as np

## Series

In [ ]:
# Series 생성
data = ['2016','2017','2018','2019']
s = pd.Series(data)
print(s)
print(type(s))

0    2016
1    2017
2    2018
3    2019
dtype: object
<class 'pandas.core.series.Series'>

In [ ]:
# index 정보
print(s.index)

RangeIndex(start=0, stop=4, step=1)

In [ ]:
# value 정보
print(s.values)

['2016' '2017' '2018' '2019']

In [ ]:
# index의 이름
s.index.name = '번호'
print(s)

번호
0    2016
1    2017
2    2018
3    2019
dtype: object

In [ ]:
# 숫자가 아닌 인덱스
result = pd.Series(data, index=['a','b','c','d'])
print(result)
print(result.index)

a    2016
b    2017
c    2018
d    2019
dtype: object
Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
# Series 이름
result.name = 'year'
result

a    2016
b    2017
c    2018
d    2019
Name: year, dtype: object

In [ ]:
score = {'Kim':85, 'Hwang':100, 'Lee':99, 'Choi':80}
result = pd.Series(score)
print(result)

Kim       85
Hwang    100
Lee       99
Choi      80
dtype: int64

In [ ]:
print(result.index)
print(result.values)

Index(['Kim', 'Hwang', 'Lee', 'Choi'], dtype='object')
[ 85 100  99  80]

In [ ]:
# 연산의 broadcast 적용
data = pd.Series([1,-1,3,5])

print(data)

data + 100

0    1
1   -1
2    3
3    5
dtype: int64

0    101
1     99
2    103
3    105
dtype: int64

## DataFrame

In [ ]:
data = {'name':['Aaa','Bbb','Ccc','Ddd'],'score':[100,80,90,60],'grade':['A','B','B+','C']}
df = pd.DataFrame(data)
df

  name  score grade
0  Aaa    100     A
1  Bbb     80     B
2  Ccc     90    B+
3  Ddd     60     C

In [ ]:
# 인덱스 확인
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
# 칼럼명
df.columns

Index(['name', 'score', 'grade'], dtype='object')

In [ ]:
# 각 칼럼의 값
df.values

array([['Aaa', 100, 'A'],
       ['Bbb', 80, 'B'],
       ['Ccc', 90, 'B+'],
       ['Ddd', 60, 'C']], dtype=object)

In [ ]:
print(df.shape)
print()
print(df.head(3))
print()
print(df.info()) # 전반적인 정보 제공 
# 인덱스 정보
# 칼럼 정보

(4, 3)

  name  score grade
0  Aaa    100     A
1  Bbb     80     B
2  Ccc     90    B+

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   score   4 non-null      int64
 2   grade   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

In [ ]:
# 이름 부여
df.index.name = 'No'
df.columns.name = 'info'
df

info name  score grade
No
0     Aaa    100     A
1     Bbb     80     B
2     Ccc     90    B+
3     Ddd     60     C

In [ ]:
c = ['name','grade','score','etc']
df2 = pd.DataFrame(data, columns = c)
df2
# NaN : Not a Number : 값이 비어 있음

  name grade  score  etc
0  Aaa     A    100  NaN
1  Bbb     B     80  NaN
2  Ccc    B+     90  NaN
3  Ddd     C     60  NaN

In [ ]:
data = {'name':['David','Roy','Tina','Kim'],'score':[78,64,70,62],'grade':['C','D','C','D']}
rst = pd.DataFrame(data = data)
rst.index.name = 'No'
rst.columns.name = 'Info'
rst

Info   name  score grade
No
0     David     78     C
1       Roy     64     D
2      Tina     70     C
3       Kim     62     D

In [ ]:
data = {'name':['David','Roy','Tina','Kim'],'score':[78,64,70,62],'grade':['C','D','C','D']}
c = ['name','grade','score','etc']
df = pd.DataFrame(data,columns=c)
df

    name grade  score  etc
0  David     C     78  NaN
1    Roy     D     64  NaN
2   Tina     C     70  NaN
3    Kim     D     62  NaN

### 인덱싱

In [ ]:
# 인덱스로 열 접근
print(df['name'])

0    David
1      Roy
2     Tina
3      Kim
Name: name, dtype: object

In [ ]:
# .으로 접근 (인덱스와 동일한 효과)
print(df.name)

0    David
1      Roy
2     Tina
3      Kim
Name: name, dtype: object

In [ ]:
rst = df[['name','grade']]
print(type(rst))
rst

<class 'pandas.core.frame.DataFrame'>

    name grade
0  David     C
1    Roy     D
2   Tina     C
3    Kim     D

In [ ]:
# 칼럼이 1개인 DataFrame 추출
rst = df[['name']]
print(type(rst))
rst

<class 'pandas.core.frame.DataFrame'>

    name
0  David
1    Roy
2   Tina
3    Kim

In [ ]:
# 리스트를 이용한 값 대입
df['etc'] = [11,22,33,44]
df

    name grade  score  etc  zeros  ones      rand
0  David     C     78   11    0.0   1.0  0.642040
1    Roy     D     64   22    0.0   1.0  0.328896
2   Tina     C     70   33    0.0   1.0  0.314576
3    Kim     D     62   44    0.0   1.0  0.717970

In [ ]:
# 스칼라 값을 이용한 값 대입
df['etc'] = 10
df

    name grade score  etc  points high_score
0  David     C    78   10     1.5       True
1    Roy     D    64   10     1.7      False
2   Tina     C    70   10     2.4       True
3    Kim     D    62   10     NaN      False
4     Su    70     C   10     NaN      False

In [ ]:
df['zeros'] = np.zeros(4)
df['ones'] = np.ones(4)
df['rand'] = np.random.rand(4)
df

    name grade  score  etc  zeros  ones      rand
0  David     C     78   11    0.0   1.0  0.830750
1    Roy     D     64   22    0.0   1.0  0.114370
2   Tina     C     70   33    0.0   1.0  0.894553
3    Kim     D     62   44    0.0   1.0  0.090213

In [ ]:
df['etc'] = [99,88,77,66]
df

    name grade  score  etc  zeros  ones      rand
0  David     C     78   99    0.0   1.0  0.830750
1    Roy     D     64   88    0.0   1.0  0.114370
2   Tina     C     70   77    0.0   1.0  0.894553
3    Kim     D     62   66    0.0   1.0  0.090213

In [ ]:
# 새로운 열 추가
points = pd.Series([1.5,1.7,2.4], index = [0,1,2])
df['points'] = points
df # 값이 부족하면 NaN 값이 들어감

    name grade score  etc  points high_score
0  David     C    78  NaN     1.5       True
1    Roy     D    64  NaN     1.7      False
2   Tina     C    70  NaN     2.4       True
3    Kim     D    62  NaN     NaN      False
4     Su    70     C    0     NaN      False

In [ ]:
# 불리언 추출
df['high_score'] = df['score'] > 65
df['high_score']

0     True
1    False
2     True
3    False
Name: high_score, dtype: bool

### CRUD

In [ ]:
# 행 추가
df.loc[4,:] = ['Su',70,'C',0.0,1.1,False]
df

    name grade score   etc  points high_score
0  David     C    78  10.0     1.5       True
1    Roy     D    64  10.0     1.7      False
2   Tina     C    70  10.0     2.4       True
3    Kim     D    62  10.0     NaN      False
4     Su    70     C   0.0     1.1      False

In [ ]:
# del 칼럼 : 원본 데이터를 삭제함
del df['high_score']
df

    name grade score   etc  points
0  David     C    78  10.0     1.5
1    Roy     D    64  10.0     1.7
2   Tina     C    70  10.0     2.4
3    Kim     D    62  10.0     NaN
4     Su    70     C   0.0     1.1

In [ ]:
# drop : 원본을 손대지 않고 복사본 생성 및 삭제
# inplace 옵션을 True로 주면 원본을 삭제
print(df.drop(4))
df

    name grade score   etc  points
0  David     C    78  10.0     1.5
1    Roy     D    64  10.0     1.7
2    Ahn     C    70  10.0     2.4
3    Kim     D    62  10.0     NaN

    name grade score   etc  points
0  David     C    78  10.0     1.5
1    Roy     D    64  10.0     1.7
2    Ahn     C    70  10.0     2.4
3    Kim     D    62  10.0     NaN
4     Su    70     C   0.0     1.1

In [ ]:
# drop 을 이용한 칼럼 삭제
df.drop('etc',axis=1)

    name grade score  points
0  David     C    78     1.5
1    Roy     D    64     1.7
2   Tina     C    70     2.4
3    Kim     D    62     NaN
4     Su    70     C     1.1

### 슬라이싱

In [ ]:
# 칼럼을 인덱스로 변환
df.set_index('name', inplace=True)
df

      grade score   etc  points
name
David     C    78  10.0     1.5
Roy       D    64  10.0     1.7
Ahn       C    70  10.0     2.4
Kim       D    62  10.0     NaN
Su       70     C   0.0     1.1

In [ ]:
# 행 슬라이싱
df[1:3]

     grade score   etc  points
name
Roy      D    64  10.0     1.7
Ahn      C    70  10.0     2.4

In [ ]:
roy_info = df.loc['Roy']
print(roy_info,'\n')
print(type(roy_info),'\n')
print(roy_info.index,'\n')
print(roy_info.values,'\n')

grade       D
score      64
etc        10
points    1.7
Name: Roy, dtype: object

<class 'pandas.core.series.Series'>

Index(['grade', 'score', 'etc', 'points'], dtype='object')

['D' 64.0 10.0 1.7]

In [ ]:
df.loc[['Roy','Ahn']]

     grade score   etc  points
name
Roy      D    64  10.0     1.7
Ahn      C    70  10.0     2.4

In [ ]:
# 원래 end는 포함하지 않지만, 문자형 인덱스를 이용한 슬라이싱에서는
# 포함한 결과를 리턴한다.
df.loc[:'Kim']

      grade score   etc  points
name
David     C    78  10.0     1.5
Roy       D    64  10.0     1.7
Ahn       C    70  10.0     2.4
Kim       D    62  10.0     NaN

In [ ]:
# 양 방향 슬라이싱
df.loc['David':'Roy','grade':'points']

      grade score   etc  points
name
David     C    78  10.0     1.5
Roy       D    64  10.0     1.7

In [ ]:
# df.iloc : 정수값을 이용한 슬라이싱
df.iloc[0:3]

      grade score   etc  points
name
David     C    78  10.0     1.5
Roy       D    64  10.0     1.7
Ahn       C    70  10.0     2.4

In [ ]:
df.iloc[0:3,[1,3]]

      score  points
name
David    78     1.5
Roy      64     1.7
Ahn      70     2.4

In [ ]:
df.loc[df['points']>1.5, : ]

     grade score   etc  points
name
Roy      D    64  10.0     1.7
Ahn      C    70  10.0     2.4

In [ ]:
df.loc[df['score']<=90, : ]

      grade score   etc  points
name
David     C    78  10.0     1.5
Roy       D    64  10.0     1.7
Ahn       C    70  10.0     2.4
Kim       D    62  10.0     NaN

In [ ]:
df = pd.DataFrame(np.arange(18).reshape(6,3), index = list('abcdef'),columns=list('xyz'))
df

    x   y   z
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11
e  12  13  14
f  15  16  17

In [ ]:
df['data1'] = pd.Series([1.7,1.2,2.4], index=['a','e','c'])
df

    x   y   z  data1
a   0   1   2    1.7
b   3   4   5    NaN
c   6   7   8    2.4
d   9  10  11    NaN
e  12  13  14    1.2
f  15  16  17    NaN

### 데이터 다듬기

In [ ]:
# dropna 
# how='all' : 전부 리턴
# how='any : 행 데이터 중 하나라도 NaN이면 제거
print(df.dropna(how='all'))
print('\n')
print(df.dropna(how='any'))

    x   y   z  data1
a   0   1   2    1.7
b   3   4   5    NaN
c   6   7   8    2.4
d   9  10  11    NaN
e  12  13  14    1.2
f  15  16  17    NaN


    x   y   z  data1
a   0   1   2    1.7
c   6   7   8    2.4
e  12  13  14    1.2

In [ ]:
df['data2'] = np.nan
df

    x   y   z  data1  data2
a   0   1   2    1.7    NaN
b   3   4   5    NaN    NaN
c   6   7   8    2.4    NaN
d   9  10  11    NaN    NaN
e  12  13  14    1.2    NaN
f  15  16  17    NaN    NaN

In [ ]:
# df.info 로 non-null 개수 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       6 non-null      int64
 1   y       6 non-null      int64
 2   z       6 non-null      int64
 3   data1   3 non-null      float64
 4   data2   0 non-null      float64
dtypes: float64(2), int64(3)
memory usage: 448.0+ bytes

In [ ]:
# isnull() : null 값은 True null값이 아니면 False 출력
df.isnull()

       x      y      z  data1  data2
a  False  False  False  False   True
b  False  False  False   True   True
c  False  False  False  False   True
d  False  False  False   True   True
e  False  False  False  False   True
f  False  False  False   True   True

In [ ]:
print(df.isnull().sum())

x        0
y        0
z        0
data1    3
data2    6
dtype: int64

In [ ]:
# df.fillna : 값 채우기, Series, DF 둘다 적용 가능
df['data2'] = df['data2'].fillna('Not Null')
df

    x   y   z  data1     data2
a   0   1   2    1.7  Not Null
b   3   4   5    NaN  Not Null
c   6   7   8    2.4  Not Null
d   9  10  11    NaN  Not Null
e  12  13  14    1.2  Not Null
f  15  16  17    NaN  Not Null

In [ ]:
# 평균값을 이용한 null값 채우기
df['data1_not_null'] = df['data1'].fillna(df['data1'].mean())
df

    x   y   z  data1     data2  data1_not_null
a   0   1   2    1.7  Not Null        1.700000
b   3   4   5    NaN  Not Null        1.766667
c   6   7   8    2.4  Not Null        2.400000
d   9  10  11    NaN  Not Null        1.766667
e  12  13  14    1.2  Not Null        1.200000
f  15  16  17    NaN  Not Null        1.766667

In [ ]:
# 정렬 전 데이터
df['data2'] = [55,np.nan,np.nan,77,np.nan,33]
df.index=['f','a','y','i','b','e']
df

    x   y   z  data1  data2  data1_not_null
f   0   1   2    1.7   55.0        1.700000
a   3   4   5    NaN    NaN        1.766667
y   6   7   8    2.4    NaN        2.400000
i   9  10  11    NaN   77.0        1.766667
b  12  13  14    1.2    NaN        1.200000
e  15  16  17    NaN   33.0        1.766667

In [ ]:
# 인덱스에 대해 오름차순 정렬
df.sort_index()

    x   y   z  data1  data2  data1_not_null
a   3   4   5    NaN    NaN        1.766667
b  12  13  14    1.2    NaN        1.200000
e  15  16  17    NaN   33.0        1.766667
f   0   1   2    1.7   55.0        1.700000
i   9  10  11    NaN   77.0        1.766667
y   6   7   8    2.4    NaN        2.400000

In [ ]:
# 인덱스를 기준으로 내림차순 정렬
df.sort_index(ascending=False)

    x   y   z  data1  data2  data1_not_null
y   6   7   8    2.4    NaN        2.400000
i   9  10  11    NaN   77.0        1.766667
f   0   1   2    1.7   55.0        1.700000
e  15  16  17    NaN   33.0        1.766667
b  12  13  14    1.2    NaN        1.200000
a   3   4   5    NaN    NaN        1.766667

In [ ]:
# 칼럼명을 기준으로 정렬
df.sort_index(axis=1)

   data1  data1_not_null  data2   x   y   z
f    1.7        1.700000   55.0   0   1   2
a    NaN        1.766667    NaN   3   4   5
y    2.4        2.400000    NaN   6   7   8
i    NaN        1.766667   77.0   9  10  11
b    1.2        1.200000    NaN  12  13  14
e    NaN        1.766667   33.0  15  16  17

In [ ]:
# 칼럼명을 기준으로 정렬
df.sort_index(axis=1, ascending=False)

    z   y   x  data2  data1_not_null  data1
f   2   1   0   55.0        1.700000    1.7
a   5   4   3    NaN        1.766667    NaN
y   8   7   6    NaN        2.400000    2.4
i  11  10   9   77.0        1.766667    NaN
b  14  13  12    NaN        1.200000    1.2
e  17  16  15   33.0        1.766667    NaN

In [ ]:
# 칼럼의 value을 기준으로 정렬
df.sort_values(by='data2')

    x   y   z  data1  data2  data1_not_null
e  15  16  17    NaN   33.0        1.766667
f   0   1   2    1.7   55.0        1.700000
i   9  10  11    NaN   77.0        1.766667
a   3   4   5    NaN    NaN        1.766667
y   6   7   8    2.4    NaN        2.400000
b  12  13  14    1.2    NaN        1.200000

In [ ]:
# 칼럼 여러개에 대해 value을 기준으로 정렬
df.sort_values(by=['data2', 'data1'])

    x   y   z  data1  data2  data1_not_null
e  15  16  17    NaN   33.0        1.766667
f   0   1   2    1.7   55.0        1.700000
i   9  10  11    NaN   77.0        1.766667
b  12  13  14    1.2    NaN        1.200000
y   6   7   8    2.4    NaN        2.400000
a   3   4   5    NaN    NaN        1.766667

###Aggregation 함수

* 집계함수의 경우 axis 방향이 반대로 적용됨

In [ ]:
# date 함수와 randn을 이용한 데이터프레임 생성
dates = pd.date_range('20130101',periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.283358 -1.304880  0.461701 -1.194206
2013-01-02  0.882651  1.076229 -0.953558 -1.663096
2013-01-03  0.402909  0.391539 -0.083561 -0.541512
2013-01-04 -0.124489  0.094773  0.274454 -1.489369
2013-01-05 -1.182310  0.130087 -0.010355 -0.487326
2013-01-06 -0.123830  0.225533  0.804987  0.238850

In [ ]:
# axis=0임에도 열방향으로 집계
df.mean(axis=0)

A   -0.071404
B    0.102214
C    0.082278
D   -0.856110
dtype: float64

In [ ]:
# axis=1 임에도 행방향으로 집계
df.mean(axis=1)

2013-01-01   -0.580186
2013-01-02   -0.164444
2013-01-03    0.042344
2013-01-04   -0.311158
2013-01-05   -0.387476
2013-01-06    0.286385
Freq: D, dtype: float64

In [ ]:
print(df.min(axis=0)) # 열방향
print(df.min(axis=1)) # 행방향

A   -1.182310
B   -1.304880
C   -0.953558
D   -1.663096
dtype: float64
2013-01-01   -1.304880
2013-01-02   -1.663096
2013-01-03   -0.541512
2013-01-04   -1.489369
2013-01-05   -1.182310
2013-01-06   -0.123830
Freq: D, dtype: float64

In [ ]:
print(df.max(axis=0)) # 열방향
print(df.max(axis=1)) # 행방향

A    0.882651
B    1.076229
C    0.804987
D    0.238850
dtype: float64
2013-01-01    0.461701
2013-01-02    1.076229
2013-01-03    0.402909
2013-01-04    0.274454
2013-01-05    0.130087
2013-01-06    0.804987
Freq: D, dtype: float64

In [ ]:
print(df.sum(axis=0)) # 열방향
print(df.sum(axis=1)) # 행방향

A   -0.428427
B    0.613281
C    0.493669
D   -5.136659
dtype: float64
2013-01-01   -2.320743
2013-01-02   -0.657774
2013-01-03    0.169376
2013-01-04   -1.244631
2013-01-05   -1.549903
2013-01-06    1.145540
Freq: D, dtype: float64

In [ ]:
df = pd.DataFrame(
    {
        'A': ['foo','bar','foo','bar','foo','bar','foo','bar'],
        'B' : ['one','two','three','one','two','three','two','three'],
        'C': np.random.randn(8),
        'D' : np.random.randn(8)
    }
)
df

     A      B         C         D
0  foo    one  1.313258  0.746156
1  bar    two -1.029306  0.116345
2  foo  three -0.297396 -0.648706
3  bar    one  0.464459 -0.652090
4  foo    two -0.993692 -1.605762
5  bar  three -1.487925  0.188342
6  foo    two  1.191070 -1.433723
7  bar  three  1.058774 -1.372990

In [ ]:
# groupby : grouby 객체 생성
df.groupby(by = 'A')

In [ ]:
df.groupby(by = 'A').sum()

            C         D
A
bar -0.993997 -1.720393
foo  1.213241 -2.942034

In [ ]:
df.groupby(by = ['A','B']).sum()

                  C         D
A   B
bar one    0.464459 -0.652090
    three -0.429150 -1.184647
    two   -1.029306  0.116345
foo one    1.313258  0.746156
    three -0.297396 -0.648706
    two    0.197379 -3.039485

In [ ]:
# 여러 가지 집계함수 한번에 적용하기
df.groupby(['A','B'])[['C','D']].agg([max,min,sum])

                  C                             D
                max       min       sum       max       min       sum
A   B
bar one    0.464459  0.464459  0.464459 -0.652090 -0.652090 -0.652090
    three  1.058774 -1.487925 -0.429150  0.188342 -1.372990 -1.184647
    two   -1.029306 -1.029306 -1.029306  0.116345  0.116345  0.116345
foo one    1.313258  1.313258  1.313258  0.746156  0.746156  0.746156
    three -0.297396 -0.297396 -0.297396 -0.648706 -0.648706 -0.648706
    two    1.191070 -0.993692  0.197379 -1.433723 -1.605762 -3.039485

In [ ]:
# 칼럼마다 다른 집계함수 적용하기
df.groupby(['A','B']).agg({'C':['min','max'],'D':'sum'})

                  C                   D
                min       max       sum
A   B
bar one    0.464459  0.464459 -0.652090
    three -1.487925  1.058774 -1.184647
    two   -1.029306 -1.029306  0.116345
foo one    1.313258  1.313258  0.746156
    three -0.297396 -0.297396 -0.648706
    two   -0.993692  1.191070 -3.039485